In [15]:
import pandas as pd
import re
import numpy as np
df_final = pd.DataFrame()
# Tente abrir o arquivo com a codificação 'latin1'
df = pd.read_csv('Resultado_Pesquisa_13112024_1315.csv', encoding='latin1', sep=';')
df['Usuário Resolvedor']

0                    José Gleyson Andrade Maia
1                      Ylanna Souza dos Santos
2                       Robison Luiz Fernandes
3      Kennedy Luis de Souza Marinho Fontinele
4                                          NaN
                        ...
620                          Osman Mamed Filho
621                   Dandara Ferreira de Lima
622                Tony Arnison Vieira e Silva
623                          Osman Mamed Filho
624                  José Gleyson Andrade Maia
Name: Usuário Resolvedor, Length: 625, dtype: object

## Codigo chamado

In [16]:
df_final['cod_chamado']= df[' Código Chamado'].fillna(df['Código do Chamado'])
df_final

     cod_chamado
0      3644682.0
1      2283692.0
2      3730390.0
3      3801653.0
4            NaN
..           ...
620    4460029.0
621    4478661.0
622    4325078.0
623    4324843.0
624    4053869.0

[625 rows x 1 columns]

## Data

In [17]:
df_final['data_completa'] = pd.to_datetime(df['DATA'], format='%d/%m/%Y %H:%M:%S')
df_final['data_avaliacao'] = df_final['data_completa'].dt.strftime('%d/%m/%Y')
df_final['hora_avaliacao'] = df_final['data_completa'].dt.strftime('%H:%M')
df_final['data_completa'] = df_final['data_completa'].dt.strftime('%d/%m/%Y %H:%M:%S')
df_final

     cod_chamado        data_completa data_avaliacao hora_avaliacao
0      3644682.0  01/07/2024 10:18:34     01/07/2024          10:18
1      2283692.0  01/07/2024 10:38:03     01/07/2024          10:38
2      3730390.0  01/07/2024 10:47:11     01/07/2024          10:47
3      3801653.0  01/07/2024 11:39:47     01/07/2024          11:39
4            NaN  01/07/2024 11:39:48     01/07/2024          11:39
..           ...                  ...            ...            ...
620    4460029.0  30/09/2024 10:17:22     30/09/2024          10:17
621    4478661.0  30/09/2024 12:50:34     30/09/2024          12:50
622    4325078.0  30/09/2024 12:53:58     30/09/2024          12:53
623    4324843.0  30/09/2024 12:58:24     30/09/2024          12:58
624    4053869.0  31/07/2024 10:15:58     31/07/2024          10:15

[625 rows x 4 columns]

## Demandante

In [18]:
df_final['orgao_demandante'] = df['USUÁRIO'].str.extract(r'@([^.]+)')
df_final['usuario_demandante'] = df['USUÁRIO'].str.extract(r'([^@]+)')
df_final.loc[:,'orgao_demandante':'usuario_demandante']

    orgao_demandante usuario_demandante
0               tjac     raimundo.sales
1               tjac    alfredo.andrade
2               tjac        osman.filho
3                uol        rlopesramos
4                uol        rlopesramos
..               ...                ...
620             tjac      maicon.araujo
621             tjac      afonso.araujo
622             tjac      afonso.araujo
623             tjac      afonso.araujo
624             tjac       william.abud

[625 rows x 2 columns]

## Avaliações

In [19]:
df_final['avaliacao_conhecimento_atendente'] = df['2. Como você avalia o conhecimento do técnico?']
df_final['avaliacao_profissionalismo_atendente'] = df['3. Como você avalia o profissionalismo do técnico?']
df_final['avaliacao_tempoSolucaoChamado'] = df['4. Como você avalia o tempo de atendimento e solução do problema?']
df_final['sugestao_melhoria'] = df['5. Sugestão para melhoria no atendimento?']

## Detalhes chamados

In [20]:
df_final['categoria_chamado'] = df['Categoria']

In [21]:
df_final['gerencia_atendente'] = df['Categoria'].apply(lambda x: 'GESIS' if pd.notna(x) and 'GESIS' in x else ('GESER' if pd.notna(x) else x))

In [22]:
df_final['equipe_atendente'] = df['Grupo Resolvedor']
df_final['tecnico_atendente'] =df['Usuário Resolvedor']

## Exportação

In [23]:
df_final.to_excel('aloo.xlsx', index=False)